extends Node

class_name HeroInventory

@onready var logic: Node = $logic

static func get_items_bank() -> Dictionary:
	return {
		0: { "icon": "🫙", "name": "Пустая банка", "short": "Позволяет хранить жидкость",
			"description": "Находится в сундуках, их наличие значительно облегчает поход." },
		1: { "icon": "🚰", "name": "Чистая вода", "short": "Восполняет ЖЗ и ДА. Ингредиент",
			"description": "Используется для создания водных растворов", "tiny": "+10 ЖЗ +10 ДА" },
		9: { "icon": "🎃", "name": "Чучело", "short": "Отвлекает противников", "recipe": "Глаз + Кость + Бинт",
			"description": "Образец собранный из подручных материалов, позволяет избежать сражения на определенное время." }
	}

func _ready() -> void:
	logic.storage = [
		{ "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 },
		{ "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 },
		{ "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 },
		{ "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 }, { "id": 0, "x": 0 },
	]
